Revit.Elements.FamilyParameter.Name
The name of the parameter.

Revit.Elements.FamilyParameter.IsReadOnly
Check if the Parameter is read only

Revit.Elements.FamilyParameter.IsShared
Check if the Parameter is shared

Revit.Elements.FamilyParameter.Group
Get the parameter's group

Revit.Elements.FamilyParameter.ParameterType
Get the parameter type

Revit.Elements.FamilyParameter.Id
Get the parameter's element Id

Revit.Elements.FamilyParameter.UnitType
Get the parameter's unit type

Revit.Elements.FamilyParameter.StorageType
Get Parameter Storage Type

Revit.Elements.FamilyParameter.CanAssignFormula
Indicates if this parameter can be assigned a formula.

Revit.Elements.FamilyParameter.IsReporting
Indicates if the parameter is a reporting parameter.